{
  "translation": {
    "header": "Portfolio",
    "search_placeholder": "Technologie",
    "footer": "© 2025 Alle Rechte vorbehalten.",
    "welcome": "Willkommen in meinem Portfolio!",
    "id": {
      "graduacao": "Postgraduiertenstudium Software Engineering - PUC Minas",
      "area": "Front-end Entwicklerin - EBAC",
      "Estudante": "Full Stack Python Studentin - EBAC",
      "tags": "Dev | React | JavaScript | TypeScript | HTML | CSS | Node.js | Websystem"
    },
    "sobre": {
      "sobreMim": "Über mich",
      "sobre": "Wer bin ich?",
      "quemEuSou": "Ich bin Monique Duarte, 30 Jahre alt, Postgraduiertenstudentin für Software Engineering an der PUC Minas. Ich suche eine Gelegenheit als Entwicklerin, leidenschaftlich für Technologie, mit Fokus auf Entwicklung, Automatisierung, KI und Innovation.",
      "oQueFaco": "Was mache ich heute?",
      "atualmente": "Ich bin eine Front-End-Entwicklerin, die sich auf die Erstellung von responsiven Webanwendungen mit React und Next.js konzentriert. Ich möchte meine Fähigkeiten einsetzen, um effiziente Lösungen mit einer großartigen Benutzererfahrung zu entwickeln, wobei ich die Praxis stets mit meiner akademischen Entwicklung verbinde.",
      "quaisObj": "Meine Ziele?",
      "objetivos": "Ich suche stets nach neuen Herausforderungen und Möglichkeiten, mein Wissen anzuwenden und zu erweitern. Mein aktuelles Ziel ist es, Erfahrung zu sammeln und mich beruflich im Programmierbereich weiterzuentwickeln, meine Fähigkeiten zu verbessern und meine Laufbahn in der Technologie zu festigen.",
      "qualtrajetoria": "Mein Werdegang",
      "trajetoria": {
        "blocos": [
          {
            "titulo": "Ausbildung & Wurzeln",
            "texto": "Ich habe einen Abschluss in Zootechnik und einen Master in Wissenschaften an der USP. Mein akademischer Werdegang hat mir eine solide Grundlage in Forschung, Analyse und Problemlösung vermittelt."
          },
          {
            "titulo": "Wechsel zur Technologie",
            "texto": "Getrieben von meiner Leidenschaft für Technologie begann ich 2024 mein Studium als FullStack-Entwicklerin an der EBAC. 2025 machte ich einen wichtigen Schritt und begann mein Postgraduiertenstudium in Software Engineering an der PUC Minas, wo ich mein Wissen in der Entwicklung hochwertiger Software vertiefte."
          },
          {
            "titulo": "Zukunft & Ziel",
            "texto": "Derzeit suche ich eine Möglichkeit als Entwicklerin, um mein Wissen einzusetzen, zu innovativen Projekten beizutragen und mich beruflich im Technologiebereich weiterzuentwickeln."
          }
        ]
      }
    },
    "projetos": "Projekte",
    "lista_projetos": "Projektliste",
    "buscarTecnologia": "Nach Technologie suchen",
    "meusConhecimentos": "Fähigkeiten",
    "basic": "Grundkenntnisse",
    "intermediate": "Fortgeschritten",
    "advanced": "Experte",
    "common": {
      "language_pt": "Portugiesisch",
      "language_en": "Englisch",
      "language_es": "Spanisch",
      "language_fr": "Französisch",
      "language_it": "Italienisch",
      "language_de": "Deutsch"
    },
    "projects": {
      "portfolio": "React Portfolio",
      "portfolioDesc": "Persönliches Portfolio, entwickelt, um meine wichtigsten Fähigkeiten, Erfahrungen und Projekte auf moderne und interaktive Weise zu präsentieren. Die Website bietet ein responsives Design, einen Wechsel zwischen hellen und dunklen Themen, sanfte Animationen und eine dynamische Projektfilterung nach Technologie. Konzipiert, um meinen Werdegang als Entwicklerin, Kreativität und Leidenschaft für Technologie hervorzuheben und gleichzeitig eine angenehme und zugängliche Navigation für Recruiter und Besucher zu bieten.",
      "portfolioAlt": "Sternenhimmel",
      "HospitalVeterinarioVital": "Tierklinik Vital",
      "HospitalVeterinarioVitalDesc": "Single-Page-Website, entwickelt für eine 24/7-Tierklinik mit zwei Standorten (Imbituba und Laguna/SC). Das Projekt wurde mit Next.js und Tailwind CSS erstellt und konzentriert sich auf ein modernes, responsives Design und eine Benutzererfahrung (UX), die für Notfallsituationen optimiert ist, mit schnellem Zugriff auf Kontakte und Standorte. Es enthält interaktive Komponenten wie ein Bilderkarussell, Video-Modals und einen dynamischen Header, der auf das Scrollen des Benutzers reagiert, um eine professionelle und vertrauenswürdige digitale Präsenz für den Kunden zu schaffen.",
      "HospitalVeterinarioVitalAlt": "Website der Tierklinik Vital auf einem Monitor",
      "portfolioNext": "NextJS Portfolio",
      "portfolioNextDesc": "Modernes und responsives Portfolio, entwickelt mit Next.js, mit Fokus auf klares Design, sanfte Animationen und Benutzererlebnis. Es ermöglicht das Umschalten zwischen hellen und dunklen Themen, zeigt Fähigkeiten in animierter Umlaufbahn und filtert Projekte nach verwendeter Technologie. Jedes Projekt wird mit einem detaillierten Modal und mehrsprachiger Integration hervorgehoben. Ideal, um technische Fähigkeiten, Kreativität und Leidenschaft für Webentwicklung zu präsentieren.",
      "techzoow": "TechZoow",
      "techzoowDesc": "Projekt für das private Unternehmen TechZoow, das meine erste Erfahrung als Freelancer markiert. Ich habe eine moderne und responsive Unternehmenswebsite mit React erstellt, die darauf abzielt, die Dienstleistungen und Stärken des Unternehmens klar und ansprechend zu präsentieren. Das Projekt umfasste die Anpassung an mobile Geräte, die Beachtung der visuellen Identität und eine professionelle Umsetzung, was meinen Einstieg in den Webentwicklungsmarkt festigte.",
      "disneyCopy": "Disney+ Klon",
      "disneyCopyDesc": "Disney+ Website-Klon, entwickelt zu Studien- und Portfoliozwecken. Das Projekt repliziert die moderne und reaktionsfähige Benutzeroberfläche des Streaming-Dienstes, einschließlich Navigation, Abonnementplänen, Anzeige kompatibler Geräte und FAQ-Bereich. Es bietet ein originalgetreues Design, sanfte Animationen und Anpassung an verschiedene Bildschirmgrößen und sorgt so für ein immersives und professionelles Benutzererlebnis.",
      "disneyCopyAlt": "Disney-Logo",
      "movieLandingPage": "Drachenzähmen leicht gemacht - Landing Page",
      "movieLandingPageDesc": "Landingpage, entwickelt als Bildungsprojekt für die EBAC, inspiriert vom Universum von 'Drachenzähmen leicht gemacht'. Die Seite bietet Informationen zu den Filmen, Charakteren und wo man sie sehen kann, mit responsivem Design, Bildergalerie und intuitiver Navigation. Ziel war es, Frontend-Fähigkeiten zu üben, ein immersives Erlebnis für Fans zu schaffen und Kenntnisse in HTML, CSS und JavaScript zu demonstrieren.",
      "movieLandingPageAlt": "Filmposter von Drachenzähmen leicht gemacht",
      "hemaToma": "Hema Toma",
      "hemaTomaDesc": "Website für eine Gruppe von Freunden, die leidenschaftlich gerne spielen, mit dem Ziel, Informationen über Events, Turniere, Mehrspieler-Missionen und gemeinsame Erlebnisse zu sammeln. Das Projekt hebt Teamarbeit, Spaß und Kameradschaft hervor und bietet Bereiche zu Lieblingsspielen, Gruppenzielen und Kontaktmöglichkeiten. Entwickelt mit Fokus auf Responsivität, Gamer-Optik und Integration dynamischer Inhalte.",
      "hemaTomaAlt": "Videospiel-Controller",
      "restaurant": "Restaurant",
      "restaurantDesc": "Landingpage für ein fiktives Restaurant, mit dem Ziel, das Menü, das Ambiente und die Besonderheiten des Lokals zu präsentieren. Die Seite bietet ein modernes Design, Bereiche für Gerichte, Kontakt und Standort und ist vollständig responsiv für verschiedene Geräte. Das Projekt wurde erstellt, um Frontend-Fähigkeiten zu üben, mit Fokus auf Benutzerfreundlichkeit, ansprechende Optik und intuitive Navigation.",
      "restaurantAlt": "Restaurant-Interieur",
      "stopwatch": "Stoppuhr",
      "stopwatchDesc": "Online-Stoppuhr-App, entwickelt, um die Zeiterfassung bei verschiedenen Aktivitäten zu erleichtern. Bietet eine einfache, reaktionsschnelle und intuitive Oberfläche, mit der Benutzer die Zeit einfach starten, pausieren und zurücksetzen können. Projekt zur Übung von React-, TypeScript- und CSS-Kenntnissen, mit Fokus auf Benutzerfreundlichkeit und Performance.",
      "stopwatchAlt": "Stoppuhr",
      "allfood": "Allfood",
      "allfoodDesc": "Plattform für Lieferdienste und Restaurants, entwickelt, um die Verwaltung von Betrieben und Bestellungen zu erleichtern, ohne dass ein Entwickler für die Pflege der Website erforderlich ist. Das Projekt umfasst ein Frontend in React.js, ein Backend in Node.js/Express, eine MongoDB-Datenbank und JWT-Authentifizierung. Benutzerfreundliche, responsive und dynamische Oberfläche, die es den Nutzern ermöglicht, Gerichte und Restaurants einfach und intuitiv zu erkunden.",
      "allfoodAlt": "Website für Essenslieferungen",
      "phoneBook": "Telefonbuch",
      "phoneBookDesc": "Webanwendung zur einfachen und effizienten Verwaltung von Kontakten. Ermöglicht das Hinzufügen, Bearbeiten, Suchen und Entfernen von Telefonnummern, mit einer responsiven und intuitiven Oberfläche. Projekt zur Übung von AngularJS-, CSS- und Bootstrap-Kenntnissen, mit Fokus auf Benutzerfreundlichkeit und Datenorganisation.",
      "phoneBookAlt": "Illustration eines Telefonbuchs",
      "randomizer": "Zufallsgenerator",
      "randomizerAlt": "Zahlenzufallsgenerator",
      "spotifyClone": "Spotify-Klon",
      "spotifyCloneDesc": "Projekt zum Klonen der Spotify-Oberfläche, entwickelt, um Fähigkeiten in JavaScript, CSS und HTML zu üben. Ziel war es, das visuelle Erlebnis der Musik-Streaming-Plattform nachzubilden, mit Navigation zwischen Playlists, individuellem Player und responsivem Layout. Ideal, um Frontend-Kenntnisse und Liebe zum UI/UX-Detail zu demonstrieren.",
      "spotifyCloneAlt": "Screenshot der Spotify-App",
      "portfolioLess": "Portfolio Less",
      "portfolioLessDesc": "Modernes Portfolio, entwickelt mit Next.js, mit Fokus auf Responsivität, Theme-Wechsel (hell/dunkel), Animationen und Benutzererlebnis. Enthält Bereiche wie Über mich, Fähigkeiten und Projekte sowie dynamische Filterung nach Technologie. Verwendet Tailwind CSS, CSS-Variablen und Internationalisierung für mehrere Sprachen. Ideal, um Frontend-Kenntnisse, UX und Best Practices zu demonstrieren.",
      "portfolioLessAlt": "Miniaturansicht der Portfolio-Website",
      "newsBlog": "Nachrichtenblog",
      "newsBlogAlt": "Zeitung",
      "nekoShop": "Neko Shop",
      "nekoShopAlt": "Orangefarbenes Katzenlogo",
      "gameShop": "Game Shop",
      "gameShopAlt": "Zwei Videospiel-Controller",
      "newsPortal": "Nachrichtenportal",
      "newsPortalAlt": "Zeitung",
      "form": "Formular",
      "formAlt": "Klemmbrett",
      "photoGallery": "Fotogalerie",
      "photoGalleryAlt": "Kamera",
      "ebacMotors": "Ebac Motors",
      "ebacMotorsAlt": "Auto",
      "salesAd": "Verkaufsanzeige",
      "salesAdAlt": "Einkaufswagen",
      "portalNewsGrid": "Portal News",
      "portalNewsGridAlt": "Zeitung",
      "agenda": "Agenda",
      "agendaAlt": "Telefon-Logo",
      "gradeSystem": "Notensystem",
      "gradeSystemAlt": "Taschenrechner",
      "todoList": "To-Do-Liste",
      "todoListAlt": "Formular",
      "sectionAriaLabel": "Projekte-Bereich mit animiertem Hintergrund",
      "siteButton": "Webseite",
      "githubButton": "GitHub",
      "aura": "Aura",
      "auraAlt": "Miniaturansicht der Aura-App in Ionic",
      "auraDesc": "Aura ist eine plattformübergreifende Finanzanwendung, die auf einem modernen Stack basiert. Ihre Architektur ist komponentenbasiert und reaktiv, wobei benutzerdefinierte Hooks zur Trennung von Geschäftslogik und Benutzeroberfläche sowie die Context API zur globalen Zustandsverwaltung verwendet werden. Dieser Ansatz führt zu einer sauberen und skalierbaren Codebasis, die den besten Entwicklungspraktiken entspricht und eine stets synchronisierte Benutzeroberfläche gewährleistet. Das Backend ist eine vollständig ‘serverless’ Lösung auf Firebase, die Cloud Firestore mit Echtzeit-Listenern für sofortige Datensynchronisierung, geplante Cloud Functions für die Automatisierung und granulare Sicherheitsregeln zum Schutz der Daten nutzt. Das Projekt zeigt fortgeschrittene Fähigkeiten durch Funktionen wie die Verwaltung von Ratenzahlungen, die gemeinsame Nutzung von Finanzdaten zwischen Benutzern und dynamische Dashboards."
    },
    "navBar": {
      "home": "Startseite",
      "aboutMe": "Über mich",
      "skills": "Fähigkeiten",
      "projects": "Projekte",
      "contact": "Kontakt"
    },
    "contact": {
      "viewResume": "Lebenslauf ansehen",
      "downloadResume": "Lebenslauf herunterladen"
    }
  }
}