{
  "translation": {
    "header": "Portfolio",
    "search_placeholder": "Technology",
    "footer": "© 2025 All rights reserved.",
    "welcome": "Welcome to my Portfolio!",
    "id": {
      "graduacao": "Postgraduate Student in Software Engineering - PUC Minas",
      "area": "Front-end Developer - EBAC",
      "Estudante": "Full Stack Python Student - EBAC",
      "tags": "Dev | React | JavaScript | TypeScript | HTML | CSS | Node.js | Web System"
    },
    "sobre": {
      "sobreMim": "About Me",
      "sobre": "Who am I?",
      "quemEuSou": "I'm Monique Duarte, 30 years old, a postgraduate student in Software Engineering at PUC Minas. I'm seeking an opportunity as a developer, passionate about technology, focused on development, automation, AI, and innovation.",
      "oQueFaco": "What do I do today?",
      "atualmente": "I'm a front-end developer focused on building responsive web applications with React and Next.js. I'm dedicated to creating efficient solutions with great user experience, constantly balancing hands-on work with my academic growth.",
      "quaisObj": "My goals?",
      "objetivos": "I am always seeking new challenges and opportunities to apply and expand my knowledge. My current goal is to gain experience and grow professionally in programming, improving my skills and consolidating my career in technology.",
      "qualtrajetoria": "My journey",
      "trajetoria": {
        "blocos": [
          {
            "titulo": "Education & Roots",
            "texto": "I hold a degree in Zootechnics and a master's in Science from USP. My academic journey provided me with a solid foundation in research, analysis, and problem-solving."
          },
          {
            "titulo": "Transition to Technology",
            "texto": "Driven by my passion for technology, in 2024 I began my studies as a FullStack developer at EBAC. In 2025, I took a significant step by starting my postgraduate studies in Software Engineering at PUC Minas, where I deepened my knowledge in high-quality software development."
          },
          {
            "titulo": "Future & Purpose",
            "texto": "Currently, I am seeking an opportunity as a developer to apply my knowledge, contribute to innovative projects, and continue growing professionally in the technology field."
          }
        ]
      }
    },
    "projetos": "Projects",
    "lista_projetos": "Project List",
    "buscarTecnologia": "Search by Technology",
    "meusConhecimentos": "Skills",
    "basic": "Basic",
    "intermediate": "Intermediate",
    "advanced": "Advanced",
    "common": {
      "language_pt": "Portuguese",
      "language_en": "English",
      "language_es": "Spanish",
      "language_fr": "French",
      "language_it": "Italian",
      "language_de": "German"
    },
    "projects": {
      "portfolio": "React Portfolio",
      "portfolioDesc": "Personal portfolio developed to showcase my main skills, experiences, and projects in a modern and interactive way. The site features a responsive design, theme switching (light/dark), smooth animations, and dynamic project filtering by technology. Designed to highlight my journey as a developer, creativity, and passion for technology, while providing a pleasant and accessible browsing experience for recruiters and visitors.",
      "portfolioAlt": "Starry sky",
      "portfolioNext": "NextJS Portfolio",
      "portfolioNextDesc": "Modern and responsive portfolio developed in Next.js, focused on clean design, smooth animations, and user experience. It allows theme switching (light/dark), displays skills in an animated orbit, and filters projects by technology. Each project is highlighted with a detailed modal and multilingual integration. Ideal for presenting technical skills, creativity, and passion for web development.",
      "techzoow": "TechZoow",
      "techzoowDesc": "Project developed for the private company TechZoow, marking my first freelance experience. I created a modern and responsive institutional website using React, focused on presenting the company's services and strengths clearly and attractively. The project included mobile adaptation, attention to visual identity, and professional delivery, consolidating my entry into the web development market.",
      "disneyCopy": "Disney+ Clone",
      "disneyCopyDesc": "Disney+ website clone developed for study and portfolio purposes. The project replicates the modern and responsive interface of the streaming service, including navigation, subscription plans, compatible devices display, and FAQ section. Features a design faithful to the original, smooth animations, and adaptation for different screen sizes, providing an immersive and professional user experience.",
      "disneyCopyAlt": "Disney logo",
      "movieLandingPage": "How to Train Your Dragon - Landing Page",
      "movieLandingPageDesc": "Landing page developed as an educational project for EBAC, inspired by the 'How to Train Your Dragon' universe. The site presents information about the movies, characters, and where to watch, with a responsive design, image gallery, and intuitive navigation. The goal was to practice front-end skills, create an immersive experience for fans, and demonstrate proficiency in HTML, CSS, and JavaScript.",
      "movieLandingPageAlt": "How to Train Your Dragon movie poster",
      "hemaToma": "Hema Toma",
      "hemaTomaDesc": "Website created for a group of friends passionate about gaming, aiming to gather information about events, tournaments, multiplayer missions, and shared experiences. The project highlights teamwork, fun, and companionship, featuring sections about favorite games, group goals, and contact options. Developed with a focus on responsiveness, gamer visuals, and dynamic content integration.",
      "hemaTomaAlt": "Video game controller",
      "restaurant": "Restaurant",
      "restaurantDesc": "Landing page developed for a fictional restaurant, aiming to showcase the menu, atmosphere, and unique features of the establishment. The site features a modern design, sections for dishes, contact, and location, and is fully responsive for different devices. The project was created to practice front-end skills, focusing on usability, attractive visuals, and intuitive navigation.",
      "restaurantAlt": "Restaurant interior",
      "stopwatch": "Stopwatch",
      "stopwatchDesc": "Online stopwatch app developed to make time tracking easy for various activities. Features a simple, responsive, and intuitive interface, allowing users to start, pause, and reset the timer effortlessly. Project created to practice skills in React, TypeScript, and CSS, focusing on usability and performance.",
      "stopwatchAlt": "Stopwatch",
      "allfood": "Allfood",
      "allfoodDesc": "Delivery and restaurant platform developed to simplify the management of establishments and orders, without requiring a developer to update the site. The project features a React.js frontend, Node.js/Express backend, MongoDB database, and JWT authentication. User-friendly, responsive, and dynamic interface, allowing users to explore dishes and restaurants easily and intuitively.",
      "allfoodAlt": "Food delivery website",
      "phoneBook": "Phone Book",
      "phoneBookDesc": "Web application developed to manage contacts simply and efficiently. Allows users to add, edit, search, and remove phone numbers, with a responsive and intuitive interface. Project created to practice skills in AngularJS, CSS, and Bootstrap, focusing on usability and data organization.",
      "phoneBookAlt": "Phone book illustration",
      "randomizer": "Randomizer",
      "randomizerAlt": "Number randomizer",
      "spotifyClone": "Spotify Clone",
      "spotifyCloneDesc": "Spotify interface clone project, developed to practice skills in JavaScript, CSS, and HTML. The goal was to recreate the visual experience of the music streaming platform, with playlist navigation, custom player, and responsive layout. Ideal to demonstrate front-end proficiency and attention to UI/UX details.",
      "spotifyCloneAlt": "Spotify app screenshot",
      "portfolioLess": "Portfolio Less",
      "portfolioLessDesc": "Modern portfolio developed with Next.js, focused on responsiveness, theme switching (light/dark), animations, and user experience. Features sections like About Me, Skills, and Projects, plus dynamic filtering by technology. Uses Tailwind CSS, CSS variables, and internationalization for multiple languages. Ideal to showcase front-end skills, UX, and best development practices.",
      "portfolioLessAlt": "Portfolio website thumbnail",
      "newsBlog": "News Blog",
      "newsBlogAlt": "Newspaper",
      "nekoShop": "Neko Shop",
      "nekoShopAlt": "Orange cat logo",
      "gameShop": "Game Shop",
      "gameShopAlt": "Two video game controllers",
      "newsPortal": "News Portal",
      "newsPortalAlt": "Newspaper",
      "form": "Form",
      "formAlt": "Clipboard",
      "photoGallery": "Photo Gallery",
      "photoGalleryAlt": "Camera",
      "ebacMotors": "Ebac Motors",
      "ebacMotorsAlt": "Car",
      "salesAd": "Sales Ad",
      "salesAdAlt": "Shopping cart",
      "portalNewsGrid": "Portal News",
      "portalNewsGridAlt": "Newspaper",
      "agenda": "Agenda",
      "agendaAlt": "Phone logo",
      "gradeSystem": "Grade System",
      "gradeSystemAlt": "Calculator",
      "todoList": "Todo List",
      "todoListAlt": "Form",
      "sectionAriaLabel": "Projects section with animated background",
      "siteButton": "Site",
      "githubButton": "GitHub",
      "aura": "Aura",
      "auraAlt": "Aura app thumbnail in Ionic",
      "auraDesc": "Aura is a cross-platform finance application built on a modern stack (Ionic, React, TypeScript, Vite). Its architecture is component-based and reactive, utilizing custom Hooks to separate business logic from the UI and the Context API for global state management. This approach results in a clean, scalable codebase aligned with best development practices, ensuring a consistently synchronized user interface. The backend is a fully serverless solution on Firebase, featuring a real-time Cloud Firestore (onSnapshot) for instant data synchronization, scheduled Cloud Functions for automation (e.g., recurring transactions), and granular security rules to protect data. The project showcases advanced capabilities through features like installment management, financial data sharing between users, and dynamic dashboards."
    },
    "navBar": {
      "home": "Home",
      "aboutMe": "About Me",
      "skills": "Skills",
      "projects": "Projects",
      "contact": "Contact"
    },
    "contact": {
      "viewResume": "View Resume",
      "downloadResume": "Download Resume"
    }
  }
}