{
  "translation": {
    "header": "Portafolio",
    "search_placeholder": "Tecnología",
    "footer": "© 2025 Todos los derechos reservados.",
    "welcome": "¡Bienvenido(a) a mi Portafolio!",
    "id": {
      "graduacao": "Posgrado en Ingeniería de Software - PUC Minas",
      "area": "Desarrolladora Front-end - EBAC",
      "Estudante": "Estudiante Full Stack Python - EBAC",
      "tags": "Dev | React | JavaScript | TypeScript | HTML | CSS | Node.js | Sistema Web"
    },
    "sobre": {
      "sobreMim": "Sobre mí",
      "sobre": "¿Quién soy?",
      "quemEuSou": "Monique Duarte, 30 años, estudiante de posgrado en Ingeniería de Software en PUC Minas. Busco una oportunidad como desarrolladora, apasionada por la tecnología, enfocada en desarrollo, automatización, IA e innovación.",
      "oQueFaco": "¿Qué hago hoy?",
      "atualmente": "Actualmente, soy pasante de front-end, colaborando con los equipos de soporte e ingeniería en el análisis y la calidad de proyectos. Mi enfoque está en soluciones automatizadas, aprendizaje con React y pruebas que optimizan procesos y mejoran la eficiencia para mí y mis colegas.",
      "quaisObj": "¿Mis objetivos?",
      "objetivos": "Siempre estoy en busca de nuevos retos y oportunidades para aplicar y ampliar mis conocimientos. Mi objetivo actual es ganar experiencia y crecer profesionalmente en el área de programación, mejorando mis habilidades y consolidando mi trayectoria en tecnología.",
      "qualtrajetoria": "Mi trayectoria",
      "trajetoria": {
        "blocos": [
          {
            "titulo": "Formación y Raíces",
            "texto": "Soy licenciada en Zootecnia y tengo una maestría en Ciencias por la USP. Mi trayectoria académica me brindó una base sólida en investigación, análisis y resolución de problemas."
          },
          {
            "titulo": "Transición a la Tecnología",
            "texto": "Impulsada por mi pasión por la tecnología, en 2024 inicié mis estudios como desarrolladora FullStack en EBAC. En 2025, di un paso importante al comenzar el posgrado en Ingeniería de Software en PUC Minas, donde profundicé mis conocimientos en desarrollo de software de alta calidad."
          },
          {
            "titulo": "Futuro y Propósito",
            "texto": "Actualmente, busco una oportunidad como desarrolladora para aplicar mis conocimientos, contribuir en proyectos innovadores y seguir creciendo profesionalmente en el área de tecnología."
          }
        ]
      }
    },
    "projetos": "Proyectos",
    "lista_projetos": "Lista de Proyectos",
    "buscarTecnologia": "Buscar por Tecnología",
    "meusConhecimentos": "Habilidades",
    "basic": "Básico",
    "intermediate": "Intermedio",
    "advanced": "Avanzado",
    "common": {
      "language_pt": "Portugués",
      "language_en": "Inglés",
      "language_es": "Español",
      "language_fr": "Francés",
      "language_it": "Italiano",
      "language_de": "Alemán"
    },
    "projects": {
      "portfolio": "Portafolio React",
      "portfolioDesc": "Portafolio personal desarrollado para presentar mis principales habilidades, experiencias y proyectos de forma moderna e interactiva. El sitio cuenta con diseño responsivo, alternancia de temas (claro/oscuro), animaciones suaves y filtrado dinámico de proyectos por tecnología. Diseñado para resaltar mi trayectoria como desarrolladora, creatividad y pasión por la tecnología, además de proporcionar una navegación agradable y accesible para reclutadores y visitantes.",
      "portfolioAlt": "Cielo estrellado",
      "portfolioNext": "Portafolio NextJS",
      "portfolioNextDesc": "Portafolio moderno y responsivo desarrollado en Next.js, enfocado en diseño limpio, animaciones suaves y experiencia de usuario. Permite alternancia entre temas claro y oscuro, muestra habilidades en animación circular y filtra proyectos por tecnología utilizada. Cada proyecto cuenta con visual destacado, modal detallado e integración multilingüe. Ideal para presentar competencias técnicas, creatividad y pasión por el desarrollo web.",
      "techzoow": "TechZoow",
      "techzoowDesc": "Proyecto desarrollado para la empresa privada TechZoow, marcando mi primera experiencia como freelancer. Creé un sitio web institucional moderno y responsivo utilizando React, enfocado en presentar los servicios y diferenciales de la empresa de manera clara y atractiva. El proyecto incluyó adaptación para dispositivos móviles, atención a la identidad visual y entrega profesional, consolidando mi entrada en el mercado de desarrollo web.",
      "disneyCopy": "Copia Disney+",
      "disneyCopyDesc": "Clon del sitio Disney+ desarrollado con fines de estudio y portafolio. El proyecto replica la interfaz moderna y responsiva del servicio de streaming, incluyendo navegación, planes de suscripción, visualización de dispositivos compatibles y sección de preguntas frecuentes. Cuenta con un diseño fiel al original, animaciones suaves y adaptación a diferentes tamaños de pantalla, proporcionando una experiencia de usuario inmersiva y profesional.",
      "disneyCopyAlt": "Logo Disney",
      "movieLandingPage": "Cómo Entrenar a tu Dragón - Landing Page",
      "movieLandingPageDesc": "Landing page desarrollada como proyecto educativo para EBAC, inspirada en el universo de 'Cómo Entrenar a tu Dragón'. El sitio presenta información sobre las películas, personajes y dónde verlas, con diseño responsivo, galería de imágenes y navegación intuitiva. El objetivo fue practicar habilidades de front-end, crear una experiencia inmersiva para los fans y demostrar dominio en HTML, CSS y JavaScript.",
      "movieLandingPageAlt": "Póster de la película Cómo entrenar a tu dragón",
      "hemaToma": "Hema Toma",
      "hemaTomaDesc": "Sitio web creado para un grupo de amigos apasionados por los juegos, con el objetivo de reunir información sobre eventos, campeonatos, misiones multijugador y experiencias compartidas. El proyecto destaca la importancia del trabajo en equipo, la diversión y la camaradería, presentando secciones sobre juegos favoritos, propósitos del grupo y formas de contacto. Desarrollado con enfoque en la responsividad, visual gamer e integración de contenidos dinámicos.",
      "hemaTomaAlt": "Mando de videojuegos",
      "restaurant": "Restaurante",
      "restaurantDesc": "Landing page desarrollada para un restaurante ficticio, con el objetivo de presentar el menú, el ambiente y los diferenciales del establecimiento. El sitio cuenta con un diseño moderno, secciones para platos, contacto y ubicación, y es totalmente responsivo para diferentes dispositivos. El proyecto fue creado para practicar habilidades de front-end, enfocándose en la usabilidad, el atractivo visual y la navegación intuitiva.",
      "restaurantAlt": "Interior de un restaurante",
      "stopwatch": "Cronómetro",
      "stopwatchDesc": "Aplicación de cronómetro en línea desarrollada para facilitar el seguimiento del tiempo en diversas actividades. Cuenta con una interfaz simple, responsiva e intuitiva, que permite iniciar, pausar y reiniciar el tiempo fácilmente. Proyecto creado para practicar habilidades en React, TypeScript y CSS, con enfoque en usabilidad y rendimiento.",
      "stopwatchAlt": "Cronómetro",
      "allfood": "Allfood",
      "allfoodDesc": "Plataforma de delivery y restaurantes desarrollada para facilitar la gestión de establecimientos y pedidos, sin necesidad de un desarrollador para actualizar el sitio. El proyecto cuenta con frontend en React.js, backend en Node.js/Express, base de datos MongoDB y autenticación JWT. Interfaz amigable, responsiva y dinámica, permitiendo a los usuarios explorar platos y restaurantes de manera práctica e intuitiva.",
      "allfoodAlt": "Sitio web de entrega de comida",
      "phoneBook": "Guía Telefónica",
      "phoneBookDesc": "Aplicación web desarrollada para gestionar contactos de forma simple y eficiente. Permite agregar, editar, buscar y eliminar números de teléfono, con una interfaz responsiva e intuitiva. Proyecto creado para practicar habilidades en AngularJS, CSS y Bootstrap, enfocándose en la usabilidad y la organización de datos.",
      "phoneBookAlt": "Ilustración de una guía telefónica",
      "randomizer": "Sorteador",
      "randomizerAlt": "Sorteador numérico",
      "spotifyClone": "Clon de Spotify",
      "spotifyCloneDesc": "Proyecto de clon de la interfaz de Spotify, desarrollado para practicar habilidades en JavaScript, CSS y HTML. El objetivo fue recrear la experiencia visual de la plataforma de streaming de música, con navegación entre playlists, reproductor personalizado y diseño responsivo. Ideal para demostrar dominio en front-end y atención a los detalles de UI/UX.",
      "spotifyCloneAlt": "Captura de pantalla de la aplicación Spotify",
      "portfolioLess": "Portafolio Less",
      "portfolioLessDesc": "Portafolio moderno desarrollado en Next.js, enfocado en la responsividad, alternancia de tema (claro/oscuro), animaciones y experiencia del usuario. Incluye secciones como Sobre mí, Habilidades y Proyectos, además de filtrado dinámico por tecnología. Utiliza Tailwind CSS, variables CSS e internacionalización para varios idiomas. Ideal para demostrar dominio en front-end, UX y mejores prácticas de desarrollo.",
      "portfolioLessAlt": "Miniatura del sitio web de portafolio",
      "newsBlog": "Blog de Noticias",
      "newsBlogAlt": "Periódico",
      "nekoShop": "Neko Shop",
      "nekoShopAlt": "Logo de gato naranja",
      "gameShop": "Tienda de Juegos",
      "gameShopAlt": "Dos mandos de videojuegos",
      "newsPortal": "Portal de Noticias",
      "newsPortalAlt": "Periódico",
      "form": "Formulario",
      "formAlt": "Portapapeles",
      "photoGallery": "Galería de Fotos",
      "photoGalleryAlt": "Cámara",
      "ebacMotors": "Ebac Motors",
      "ebacMotorsAlt": "Coche",
      "salesAd": "Anuncio de Venta",
      "salesAdAlt": "Carrito de compras",
      "portalNewsGrid": "Portal News",
      "portalNewsGridAlt": "Periódico",
      "agenda": "Agenda",
      "agendaAlt": "Logo de teléfono",
      "gradeSystem": "Sistema de Promedios",
      "gradeSystemAlt": "Calculadora",
      "todoList": "Lista de Tareas",
      "todoListAlt": "Formulario",
      "sectionAriaLabel": "Sección de proyectos con fondo animado",
      "siteButton": "Sitio",
      "githubButton": "GitHub",
      "aura": "Aura",
      "auraAlt": "Miniatura de la app Aura en Ionic",
      "auraDesc": "Aura es una aplicación de finanzas multiplataforma construida sobre un stack moderno. Su arquitectura está componentizada y es reactiva, utilizando Hooks personalizados para separar la lógica de negocio de la UI y la Context API para la gestión del estado global. Este enfoque resulta en una base de código limpia y escalable, alineada con las mejores prácticas de desarrollo, que garantiza una interfaz de usuario siempre sincronizada. El backend es una solución completamente ‘serverless’ en Firebase, que utiliza Cloud Firestore en tiempo real para la sincronización instantánea de datos, Cloud Functions programadas para la automatización y reglas de seguridad granulares para proteger los datos. El proyecto demuestra capacidades avanzadas a través de funcionalidades como la gestión de pagos a plazos, el uso compartido de finanzas entre usuarios y dashboards dinámicos."
    },
    "navBar": {
      "home": "Inicio",
      "aboutMe": "Sobre mí",
      "skills": "Habilidades",
      "projects": "Proyectos",
      "contact": "Contacto"
    },
    "contact": {
      "viewResume": "Ver Currículum",
      "downloadResume": "Descargar Currículum"
    }
  }
}