{
  "translation": {
    "header": "Portfolio",
    "search_placeholder": "Technologie",
    "footer": "© 2025 Tous droits réservés.",
    "welcome": "Bienvenue dans mon portfolio !",
    "id": {
      "graduacao": "Postgraduate en Génie Logiciel - PUC Minas",
      "area": "Développeuse Front-end - EBAC",
      "Estudante": "Étudiante Full Stack Python - EBAC",
      "tags": "Dev | React | JavaScript | TypeScript | HTML | CSS | Node.js | Système Web"
    },
    "sobre": {
      "sobreMim": "À propos de moi",
      "sobre": "Qui suis-je ?",
      "quemEuSou": "Je suis Monique Duarte, 30 ans, étudiante en postgraduate en génie logiciel à la PUC Minas. Je cherche une opportunité en tant que développeuse, passionnée par la technologie, avec un focus sur le développement, l'automatisation, l'IA et l'innovation.",
      "oQueFaco": "Que fais-je aujourd'hui ?",
      "atualmente": "Je suis une développeuse front-end axée sur la création d'applications web responsives avec React et Next.js. Je cherche à mettre mes compétences en œuvre pour concevoir des solutions efficaces avec une excellente expérience utilisateur, en alliant constamment la pratique à mon développement académique.",
      "quaisObj": "Mes objectifs ?",
      "objetivos": "Je suis toujours à la recherche de nouveaux défis et opportunités pour appliquer et étendre mes connaissances. Mon objectif actuel est d'acquérir de l'expérience et de progresser professionnellement dans la programmation, en améliorant mes compétences et en consolidant mon parcours dans la technologie.",
      "qualtrajetoria": "Mon parcours",
      "trajetoria": {
        "blocos": [
          {
            "titulo": "Formation & Racines",
            "texto": "Je suis diplômée en zootechnie et titulaire d'un master en sciences de l’USP. Mon parcours académique m’a apporté une solide base en recherche, analyse et résolution de problèmes."
          },
          {
            "titulo": "Transition vers la Technologie",
            "texto": "Animée par ma passion pour la technologie, j’ai débuté en 2024 une formation de développeuse FullStack à l’EBAC. En 2025, j’ai franchi une étape importante en commençant un postgraduate en Génie Logiciel à la PUC Minas, où j’ai approfondi mes compétences en développement logiciel de haute qualité."
          },
          {
            "titulo": "Avenir & Objectif",
            "texto": "Actuellement, je recherche une opportunité en tant que développeuse pour mettre en pratique mes connaissances, contribuer à des projets innovants et continuer à évoluer professionnellement dans le domaine technologique."
          }
        ]
      }
    },
    "projetos": "Projets",
    "lista_projetos": "Liste de Projets",
    "buscarTecnologia": "Rechercher par Technologie",
    "meusConhecimentos": "Compétences",
    "basic": "Débutant",
    "intermediate": "Intermédiaire",
    "advanced": "Avancé",
    "common": {
      "language_pt": "Portugais",
      "language_en": "Anglais",
      "language_es": "Espagnol",
      "language_fr": "Français",
      "language_it": "Italien",
      "language_de": "Allemand"
    },
    "projects": {
      "portfolio": "Portfolio React",
      "portfolioDesc": "Portfolio personnel développé pour présenter mes principales compétences, expériences et projets de manière moderne et interactive. Le site propose un design réactif, une alternance de thèmes (clair/sombre), des animations fluides et un filtrage dynamique des projets par technologie. Conçu pour mettre en valeur mon parcours de développeuse, ma créativité et ma passion pour la technologie, tout en offrant une navigation agréable et accessible aux recruteurs et visiteurs.",
      "portfolioAlt": "Ciel étoilé",
      "portfolioNext": "Portfolio NextJS",
      "portfolioNextDesc": "Portfolio moderne et réactif développé avec Next.js, axé sur un design épuré, des animations fluides et l'expérience utilisateur. Permet l'alternance entre les thèmes clair et sombre, affiche les compétences en orbite animée et filtre les projets par technologie utilisée. Chaque projet est mis en avant avec un modal détaillé et une intégration multilingue. Idéal pour présenter des compétences techniques, la créativité et la passion pour le développement web.",
      "techzoow": "TechZoow",
      "techzoowDesc": "Projet réalisé pour l'entreprise privée TechZoow, marquant ma première expérience en tant que freelance. J'ai créé un site institutionnel moderne et réactif avec React, axé sur la présentation des services et atouts de l'entreprise de manière claire et attrayante. Le projet a impliqué une adaptation mobile, le respect de l'identité visuelle et une livraison professionnelle, consolidant ainsi mon entrée sur le marché du développement web.",
      "disneyCopy": "Clone Disney+",
      "disneyCopyDesc": "Clone du site Disney+ développé à des fins d'étude et de portfolio. Le projet reproduit l'interface moderne et réactive du service de streaming, incluant la navigation, les plans d'abonnement, l'affichage des appareils compatibles et la section FAQ. Il propose un design fidèle à l'original, des animations fluides et une adaptation à différents formats d'écran, offrant une expérience utilisateur immersive et professionnelle.",
      "disneyCopyAlt": "Logo Disney",
      "movieLandingPage": "Dragons : L’histoire d’un héros - Landing Page",
      "movieLandingPageDesc": "Landing page réalisée comme projet éducatif pour EBAC, inspirée de l’univers de 'Dragons'. Le site présente des informations sur les films, les personnages et où les regarder, avec un design réactif, une galerie d’images et une navigation intuitive. L’objectif était de pratiquer les compétences front-end, de créer une expérience immersive pour les fans et de démontrer la maîtrise de HTML, CSS et JavaScript.",
      "movieLandingPageAlt": "Affiche du film Comment dresser votre dragon",
      "hemaToma": "Hema Toma",
      "hemaTomaDesc": "Site créé pour un groupe d'amis passionnés de jeux vidéo, visant à rassembler des informations sur les événements, tournois, missions multijoueurs et expériences partagées. Le projet met en avant le travail d'équipe, le plaisir et la camaraderie, avec des sections sur les jeux préférés, les objectifs du groupe et les moyens de contact. Développé avec un accent sur la réactivité, le visuel gamer et l'intégration de contenus dynamiques.",
      "hemaTomaAlt": "Manette de jeu vidéo",
      "restaurant": "Restaurant",
      "restaurantDesc": "Landing page réalisée pour un restaurant fictif, visant à présenter le menu, l’ambiance et les atouts de l’établissement. Le site propose un design moderne, des sections pour les plats, le contact et la localisation, et il est entièrement réactif pour tous les appareils. Le projet a été créé pour pratiquer les compétences front-end, en mettant l’accent sur l’utilisabilité, le visuel attrayant et la navigation intuitive.",
      "restaurantAlt": "Intérieur d'un restaurant",
      "stopwatch": "Chronomètre",
      "stopwatchDesc": "Application de chronomètre en ligne développée pour faciliter le suivi du temps dans diverses activités. Interface simple, réactive et intuitive, permettant de démarrer, mettre en pause et réinitialiser le temps facilement. Projet réalisé pour pratiquer React, TypeScript et CSS, avec un accent sur l’utilisabilité et la performance.",
      "stopwatchAlt": "Chronomètre",
      "allfood": "Allfood",
      "allfoodDesc": "Plateforme de livraison et de restaurants développée pour faciliter la gestion des établissements et des commandes, sans nécessiter de développeur pour alimenter le site. Le projet comprend un frontend en React.js, un backend en Node.js/Express, une base de données MongoDB et une authentification JWT. Interface conviviale, réactive et dynamique, permettant aux utilisateurs d’explorer les plats et restaurants de manière pratique et intuitive.",
      "allfoodAlt": "Site de livraison de nourriture",
      "phoneBook": "Annuaire Téléphonique",
      "phoneBookDesc": "Application web développée pour gérer les contacts de manière simple et efficace. Permet d’ajouter, modifier, rechercher et supprimer des numéros de téléphone, avec une interface réactive et intuitive. Projet réalisé pour pratiquer AngularJS, CSS et Bootstrap, en mettant l’accent sur l’utilisabilité et l’organisation des données.",
      "phoneBookAlt": "Illustration d'un annuaire téléphonique",
      "randomizer": "Sélectionneur Aléatoire",
      "randomizerAlt": "Sélecteur numérique",
      "spotifyClone": "Clone Spotify",
      "spotifyCloneDesc": "Projet de clonage de l’interface Spotify, développé pour pratiquer JavaScript, CSS et HTML. L’objectif était de recréer l’expérience visuelle de la plateforme de streaming musical, avec navigation entre playlists, lecteur personnalisé et mise en page réactive. Idéal pour démontrer la maîtrise du front-end et l’attention aux détails UI/UX.",
      "spotifyCloneAlt": "Capture d'écran de l'application Spotify",
      "portfolioLess": "Portfolio Less",
      "portfolioLessDesc": "Portfolio moderne développé avec Next.js, axé sur la réactivité, l’alternance de thème (clair/sombre), les animations et l’expérience utilisateur. Comprend des sections telles que À propos de moi, Compétences et Projets, ainsi qu’un filtrage dynamique par technologie. Utilise Tailwind CSS, des variables CSS et l’internationalisation pour plusieurs langues. Idéal pour démontrer la maîtrise du front-end, de l’UX et des meilleures pratiques de développement.",
      "portfolioLessAlt": "Miniature du site de portfolio",
      "newsBlog": "Blog d'Actualités",
      "newsBlogAlt": "Journal",
      "nekoShop": "Neko Shop",
      "nekoShopAlt": "Logo chat orange",
      "gameShop": "Boutique de Jeux",
      "gameShopAlt": "Deux manettes de jeu vidéo",
      "newsPortal": "Portail d'Actualités",
      "newsPortalAlt": "Journal",
      "form": "Formulaire",
      "formAlt": "Presse-papiers",
      "photoGallery": "Galerie de Photos",
      "photoGalleryAlt": "Appareil photo",
      "ebacMotors": "Ebac Motors",
      "ebacMotorsAlt": "Voiture",
      "salesAd": "Annonce de Vente",
      "salesAdAlt": "Panier d'achat",
      "portalNewsGrid": "Portal News",
      "portalNewsGridAlt": "Journal",
      "agenda": "Agenda",
      "agendaAlt": "Logo téléphone",
      "gradeSystem": "Système de Notes",
      "gradeSystemAlt": "Calculatrice",
      "todoList": "Liste de Tâches",
      "todoListAlt": "Formulaire",
      "sectionAriaLabel": "Section projets avec fond animé",
      "siteButton": "Site",
      "githubButton": "GitHub",
      "aura": "Aura",
      "auraAlt": "Miniature de l'application Aura en Ionic",
      "auraDesc": "Aura est une application financière multiplateforme développée sur une stack moderne. Son architecture est componentisée et réactive, utilisant des Hooks personnalisés pour séparer la logique métier de l'interface utilisateur et l'API Context pour la gestion de l'état global. Cette approche aboutit à une base de code propre et évolutive, alignée sur les meilleures pratiques de développement, garantissant une interface utilisateur constamment synchronisée. Le backend est une solution entièrement ‘serverless’ sur Firebase, utilisant Cloud Firestore en temps réel pour une synchronisation instantanée des données, des Cloud Functions planifiées pour l'automatisation et des règles de sécurité granulaires pour protéger les données. Le projet démontre des capacités avancées à travers des fonctionnalités telles que la gestion des paiements échelonnés, le partage de données financières entre utilisateurs et des tableaux de bord dynamiques."
    },
    "navBar": {
      "home": "Accueil",
      "aboutMe": "À propos",
      "skills": "Compétences",
      "projects": "Projets",
      "contact": "Contact"
    },
    "contact": {
      "viewResume": "Voir le CV",
      "downloadResume": "Télécharger le CV"
    }
  }
}