{
  "translation": {
    "header": "Portfolio",
    "search_placeholder": "Tecnologia",
    "footer": "© 2025 Tutti i diritti riservati.",
    "welcome": "Benvenuto/a nel mio Portfolio!",
    "id": {
      "graduacao": "Post-laurea in Ingegneria del Software - PUC Minas",
      "area": "Sviluppatrice Front-end - EBAC",
      "Estudante": "Studentessa Full Stack Python - EBAC",
      "tags": "Dev | React | JavaScript | TypeScript | HTML | CSS | Node.js | Sistema Web"
    },
    "sobre": {
      "sobreMim": "Su di me",
      "sobre": "Chi sono?",
      "quemEuSou": "Monique Duarte, 30 anni, studentessa di post-laurea in Ingegneria del Software presso PUC Minas. Cerco un'opportunità come sviluppatrice, appassionata di tecnologia, con focus su sviluppo, automazione, IA e innovazione.",
      "oQueFaco": "Cosa faccio oggi?",
      "atualmente": "Sono una sviluppatrice front-end specializzata nella creazione di applicazioni web responsive con React e Next.js. Il mio obiettivo è applicare le mie competenze per costruire soluzioni efficienti con un'ottima esperienza utente, combinando sempre la pratica con il mio sviluppo accademico.",
      "quaisObj": "I miei obiettivi?",
      "objetivos": "Sono sempre alla ricerca di nuove sfide e opportunità per applicare ed espandere le mie conoscenze. Il mio obiettivo attuale è acquisire esperienza e crescere professionalmente nell'ambito della programmazione, migliorando le mie competenze e consolidando il mio percorso nella tecnologia.",
      "qualtrajetoria": "Il mio percorso",
      "trajetoria": {
        "blocos": [
          {
            "titulo": "Formazione & Radici",
            "texto": "Sono laureata in Zootecnia e ho conseguito un dottorato in Scienze presso l’USP. Il mio percorso accademico mi ha fornito una solida base in ricerca, analisi e problem solving."
          },
          {
            "titulo": "Transizione verso la Tecnologia",
            "texto": "Spinta dalla passione per la tecnologia, nel 2024 ho iniziato gli studi come sviluppatrice FullStack presso EBAC. Nel 2025 ho compiuto un passo importante iniziando il post-laurea in Ingegneria del Software alla PUC Minas, dove ho approfondito le mie competenze nello sviluppo di software di alta qualità."
          },
          {
            "titulo": "Futuro & Proposito",
            "texto": "Attualmente sono alla ricerca di un’opportunità come sviluppatrice per applicare le mie conoscenze, contribuire a progetti innovativi e continuare a crescere professionalmente nel settore tecnologico."
          }
        ]
      }
    },
    "projetos": "Progetti",
    "lista_projetos": "Elenco Progetti",
    "buscarTecnologia": "Cerca per Tecnologia",
    "meusConhecimentos": "Competenze",
    "basic": "Base",
    "intermediate": "Intermedio",
    "advanced": "Avanzato",
    "common": {
      "language_pt": "Portoghese",
      "language_en": "Inglese",
      "language_es": "Spagnolo",
      "language_fr": "Francese",
      "language_it": "Italiano",
      "language_de": "Tedesco"
    },
    "projects": {
      "portfolio": "Portfolio React",
      "portfolioDesc": "Portfolio personale sviluppato per presentare le mie principali competenze, esperienze e progetti in modo moderno e interattivo. Il sito presenta un design reattivo, alternanza di temi (chiaro/scuro), animazioni fluide e filtraggio dinamico dei progetti per tecnologia. Ideato per evidenziare il mio percorso come sviluppatrice, creatività e passione per la tecnologia, oltre a offrire una navigazione piacevole e accessibile a recruiter e visitatori.",
      "portfolioAlt": "Cielo stellato",
      "HospitalVeterinarioVital": "Ospedale Veterinario Vital",
      "HospitalVeterinarioVitalDesc": "Sito web a pagina singola (single-page) sviluppato per un ospedale veterinario aperto 24 ore su 24 con due sedi (Imbituba e Laguna/SC). Il progetto è stato realizzato con Next.js e Tailwind CSS, con un focus su un design moderno, reattivo e un'esperienza utente (UX) ottimizzata per situazioni di emergenza, con accesso rapido a contatti e posizione. Include componenti interattivi come un carosello di immagini, modali video e un'intestazione dinamica che reagisce allo scorrimento dell'utente, consolidando una presenza digitale professionale e affidabile per il cliente.",
      "HospitalVeterinarioVitalAlt": "web dell'Ospedale Veterinario Vital su un monitor",
      "portfolioNext": "Portfolio NextJS",
      "portfolioNextDesc": "Portfolio moderno e responsivo sviluppato in Next.js, focalizzato su design pulito, animazioni fluide ed esperienza utente. Permette l'alternanza tra temi chiaro e scuro, mostra le competenze in orbita animata e filtra i progetti per tecnologia utilizzata. Ogni progetto è evidenziato con un modal dettagliato e integrazione multilingue. Ideale per presentare competenze tecniche, creatività e passione per lo sviluppo web.",
      "techzoow": "TechZoow",
      "techzoowDesc": "Progetto sviluppato per l'azienda privata TechZoow, segnando la mia prima esperienza come freelance. Ho realizzato un sito istituzionale moderno e responsivo utilizzando React, con l'obiettivo di presentare i servizi e i punti di forza dell'azienda in modo chiaro e accattivante. Il progetto ha previsto l'adattamento ai dispositivi mobili, attenzione all'identità visiva e una consegna professionale, consolidando il mio ingresso nel mercato dello sviluppo web.",
      "disneyCopy": "Clone Disney+",
      "disneyCopyDesc": "Clone del sito Disney+ sviluppato a scopo di studio e portfolio. Il progetto replica l'interfaccia moderna e reattiva del servizio di streaming, inclusa la navigazione, i piani di abbonamento, la visualizzazione dei dispositivi compatibili e la sezione FAQ. Presenta un design fedele all'originale, animazioni fluide e adattamento a diverse dimensioni dello schermo, offrendo un'esperienza utente immersiva e professionale.",
      "disneyCopyAlt": "Logo Disney",
      "movieLandingPage": "Dragon Trainer - Landing Page",
      "movieLandingPageDesc": "Landing page sviluppata come progetto educativo per EBAC, ispirata all'universo di 'Dragon Trainer'. Il sito presenta informazioni sui film, personaggi e dove guardarli, con design responsivo, galleria di immagini e navigazione intuitiva. L'obiettivo era esercitare le competenze front-end, creare un'esperienza immersiva per i fan e dimostrare padronanza di HTML, CSS e JavaScript.",
      "movieLandingPageAlt": "Locandina del film Dragon Trainer",
      "hemaToma": "Hema Toma",
      "hemaTomaDesc": "Sito creato per un gruppo di amici appassionati di giochi, con l'obiettivo di raccogliere informazioni su eventi, tornei, missioni multiplayer ed esperienze condivise. Il progetto valorizza il lavoro di squadra, il divertimento e la compagnia, presentando sezioni sui giochi preferiti, gli obiettivi del gruppo e i contatti. Sviluppato con attenzione alla responsività, al look gamer e all'integrazione di contenuti dinamici.",
      "hemaTomaAlt": "Controller per videogiochi",
      "restaurant": "Ristorante",
      "restaurantDesc": "Landing page sviluppata per un ristorante fittizio, con l'obiettivo di presentare il menù, l'ambiente e i punti di forza del locale. Il sito presenta un design moderno, sezioni per i piatti, i contatti e la posizione, ed è completamente responsivo per diversi dispositivi. Il progetto è stato creato per esercitare le competenze front-end, puntando su usabilità, visual accattivante e navigazione intuitiva.",
      "restaurantAlt": "Interno di un ristorante",
      "stopwatch": "Cronometro",
      "stopwatchDesc": "Applicazione cronometro online sviluppata per facilitare il monitoraggio del tempo in varie attività. Interfaccia semplice, reattiva e intuitiva, che consente di avviare, mettere in pausa e azzerare il tempo facilmente. Progetto creato per esercitare competenze in React, TypeScript e CSS, con attenzione a usabilità e performance.",
      "stopwatchAlt": "Cronometro",
      "allfood": "Allfood",
      "allfoodDesc": "Piattaforma di delivery e ristoranti sviluppata per facilitare la gestione di locali e ordini, senza la necessità di uno sviluppatore per aggiornare il sito. Il progetto include frontend in React.js, backend in Node.js/Express, database MongoDB e autenticazione JWT. Interfaccia user-friendly, responsiva e dinamica, che consente agli utenti di esplorare piatti e ristoranti in modo pratico e intuitivo.",
      "allfoodAlt": "Sito di consegna cibo",
      "phoneBook": "Rubrica Telefonica",
      "phoneBookDesc": "Applicazione web sviluppata per gestire i contatti in modo semplice ed efficiente. Consente di aggiungere, modificare, cercare e rimuovere numeri di telefono, con un'interfaccia reattiva e intuitiva. Progetto creato per esercitare competenze in AngularJS, CSS e Bootstrap, con attenzione a usabilità e organizzazione dei dati.",
      "phoneBookAlt": "Illustrazione di una rubrica telefonica",
      "randomizer": "Estrattore",
      "randomizerAlt": "Estrattore numerico",
      "spotifyClone": "Clone Spotify",
      "spotifyCloneDesc": "Progetto di clonazione dell'interfaccia di Spotify, sviluppato per esercitare competenze in JavaScript, CSS e HTML. L'obiettivo era ricreare l'esperienza visiva della piattaforma di streaming musicale, con navigazione tra playlist, player personalizzato e layout responsivo. Ideale per dimostrare padronanza del front-end e attenzione ai dettagli UI/UX.",
      "spotifyCloneAlt": "Screenshot dell'app Spotify",
      "portfolioLess": "Portfolio Less",
      "portfolioLessDesc": "Portfolio moderno sviluppato con Next.js, focalizzato su reattività, cambio tema (chiaro/scuro), animazioni ed esperienza utente. Include sezioni come Su di me, Competenze e Progetti, oltre a filtri dinamici per tecnologia. Utilizza Tailwind CSS, variabili CSS e internazionalizzazione per più lingue. Ideale per dimostrare padronanza del front-end, UX e best practice di sviluppo.",
      "portfolioLessAlt": "Miniatura del sito portfolio",
      "newsBlog": "Blog di Notizie",
      "newsBlogAlt": "Giornale",
      "nekoShop": "Neko Shop",
      "nekoShopAlt": "Logo gatto arancione",
      "gameShop": "Game Shop",
      "gameShopAlt": "Due controller per videogiochi",
      "newsPortal": "Portale di Notizie",
      "newsPortalAlt": "Giornale",
      "form": "Modulo",
      "formAlt": "Appunti",
      "photoGallery": "Galleria Fotografica",
      "photoGalleryAlt": "Fotocamera",
      "ebacMotors": "Ebac Motors",
      "ebacMotorsAlt": "Auto",
      "salesAd": "Annuncio di Vendita",
      "salesAdAlt": "Carrello della spesa",
      "portalNewsGrid": "Portal News",
      "portalNewsGridAlt": "Giornale",
      "agenda": "Agenda",
      "agendaAlt": "Logo telefono",
      "gradeSystem": "Sistema di Voti",
      "gradeSystemAlt": "Calcolatrice",
      "todoList": "Lista delle Cose da Fare",
      "todoListAlt": "Modulo",
      "sectionAriaLabel": "Sezione progetti con sfondo animato",
      "siteButton": "Sito",
      "githubButton": "GitHub",
      "aura": "Aura",
      "auraAlt": "Miniatura dell'app Aura in Ionic",
      "auraDesc": "Aura è un'applicazione finanziaria multipiattaforma costruita su uno stack moderno. La sua architettura è componentizzata e reattiva, utilizzando Hook personalizzati per separare la logica di business dall'interfaccia utente e la Context API per la gestione dello stato globale. Questo approccio si traduce in una codebase pulita e scalabile, in linea con le migliori pratiche di sviluppo, che garantisce un'interfaccia utente costantemente sincronizzata. Il backend è una soluzione completamente ‘serverless’ su Firebase, che utilizza Cloud Firestore in tempo reale per la sincronizzazione istantanea dei dati, Cloud Functions pianificate per l'automazione e regole di sicurezza granulari per proteggere i dati. Il progetto dimostra capacità avanzate attraverso funzionalità come la gestione dei pagamenti rateali, la condivisione di dati finanziari tra utenti e dashboard dinamiche."
    },
    "navBar": {
      "home": "Home",
      "aboutMe": "Su di me",
      "skills": "Competenze",
      "projects": "Progetti",
      "contact": "Contatto"
    },
    "contact": {
      "viewResume": "Visualizza Curriculum",
      "downloadResume": "Scarica Curriculum"
    },
    "resumeCard": {
      "title": "Curriculum",
      "status": "Disponibile per nuove opportunità",
      "viewPT": "Visualizza (PT)",
      "viewEN": "Visualizza (EN)",
      "downloadPT": "Scarica (PT)",
      "downloadEN": "Scarica (EN)"
    }
  }
}