{
  "translation": {
    "header": "Portfólio",
    "search_placeholder": "Tecnologia",
    "footer": "© 2025 Todos os direitos reservados.",
    "welcome": "Bem-vindo(a) ao meu Portfólio!",
    "id": {
      "graduacao": "Pós-graduanda Engenharia de Software - PUC Minas",
      "area": "Desenvolvedora Front-end - EBAC",
      "Estudante": "Full Stack Python - EBAC",
      "tags": "Dev | React | JavaScript | TypeScript | HTML | CSS | Node.js | Sistema Web"
    },
    "sobre": {
      "sobreMim": "Sobre mim",
      "sobre": "Quem sou eu?",
      "quemEuSou": "Monique Duarte, 30 anos, estudante de Pós-graduação em Engenharia de Software pela PUC Minas. Busco uma oportunidade como desenvolvedora, apaixonada por tecnologia, com foco em desenvolvimento, automação, IA e inovação.",
      "oQueFaco": "O que faço hoje?",
      "atualmente": "Sou uma desenvolvedora front-end focada em criar aplicações web responsivas com React e Next.js. Busco aplicar minhas habilidades para construir soluções eficientes e com ótima experiência do usuário, sempre combinando a prática com meu desenvolvimento acadêmico.",
      "quaisObj": "Meus objetivos?",
      "objetivos": "Estou sempre em busca de novos desafios e oportunidades para aplicar e expandir meus conhecimentos. Meu objetivo atual é ganhar experiência e crescer profissionalmente na área de programação, aprimorando minhas habilidades e consolidando minha trajetória na tecnologia.",
      "qualtrajetoria": "Minha trajetória",
      "trajetoria": {
        "blocos": [
          {
            "titulo": "Formação & Raízes",
            "texto": "Sou formada em Zootecnia e possuo mestrado em Ciências pela USP. Minha trajetória acadêmica me proporcionou uma base sólida em pesquisa, análise e resolução de problemas."
          },
          {
            "titulo": "Transição para Tecnologia",
            "texto": "Movida pela paixão por tecnologia, em 2024 iniciei meus estudos como desenvolvedora FullStack na EBAC. Em 2025, dei mais um passo importante ao ingressar na Pós-graduação em Engenharia de Software pela PUC Minas, onde aprofundei meus conhecimentos em desenvolvimento de software de alta qualidade."
          },
          {
            "titulo": "Futuro & Propósito",
            "texto": "Atualmente, busco uma oportunidade como desenvolvedora para aplicar meus conhecimentos, contribuir com projetos inovadores e continuar crescendo profissionalmente na área de tecnologia."
          }
        ]
      }
    },
    "projetos": "Destaques",
    "lista_projetos": "Lista de Projetos",
    "buscarTecnologia": "Buscar por Tecnologia",
    "meusConhecimentos": "Habilidades",
    "basic": "Básico",
    "intermediate": "Intermediário",
    "advanced": "Avançado",
    "common": {
      "language_pt": "Português",
      "language_en": "Inglês",
      "language_es": "Espanhol",
      "language_fr": "Francês",
      "language_it": "Italiano",
      "language_de": "Alemão"
    },
    "projects": {
      "portfolio": "Portfólio React",
      "portfolioDesc": "Portfólio pessoal desenvolvido para apresentar minhas principais habilidades, experiências e projetos de forma moderna e interativa. O site conta com design responsivo, alternância de temas (claro/escuro), animações suaves e filtragem dinâmica de projetos por tecnologia. Idealizado para destacar minha trajetória como desenvolvedora, criatividade e paixão por tecnologia, além de proporcionar uma navegação agradável e acessível para recrutadores e visitantes.",
      "portfolioAlt": "Céu estrelado",
      "HospitalVeterinarioVital": "Hospital Veterinário Vital",
      "HospitalVeterinarioVitalDesc": "Website single-page desenvolvido para um hospital veterinário 24h com duas unidades. O projeto foi construído com Next.js e Tailwind CSS, focando em um design moderno, responsivo e uma experiência de usuário (UX) otimizada para situações de emergência, com acesso rápido a contatos e localização. Inclui componentes interativos de imagens, modais de vídeo e um cabeçalho dinâmico que reage à rolagem do usuário, consolidando uma presença digital profissional e confiável para o cliente.",
      "HospitalVeterinarioVitalAlt": "Website do Hospital Veterinário Vital em um monitor",
      "portfolioNext": "Portfólio NextJS",
      "portfolioNextDesc": "Portfólio moderno e responsivo desenvolvido em Next.js, com foco em design limpo, animações suaves e experiência do usuário. Permite alternância entre temas claro e escuro, exibe habilidades em animação circular e filtra projetos por tecnologia utilizada. Cada projeto conta com visual de destaque, modal detalhado e integração multilíngue. Ideal para apresentar competências técnicas, criatividade e paixão por desenvolvimento web.",
      "techzoow": "TechZoow",
      "techzoowDesc": "Projeto desenvolvido para a empresa privada TechZoow, marcando minha primeira experiência como freelancer. Criei um site institucional moderno e responsivo utilizando React, com foco em apresentar os serviços e diferenciais da empresa de forma clara e atrativa. O projeto envolveu adaptação para dispositivos móveis, atenção à identidade visual e entrega profissional, consolidando minha entrada no mercado de desenvolvimento web.",
      "disneyCopy": "Cópia Disney +",
      "disneyCopyDesc": "Clone do site Disney+ desenvolvido para fins de estudo e portfólio. O projeto replica a interface moderna e responsiva do serviço de streaming, incluindo navegação, planos de assinatura, exibição de dispositivos compatíveis e perguntas frequentes. Conta com design fiel ao original, animações suaves e adaptação para diferentes tamanhos de tela, proporcionando uma experiência de usuário imersiva e profissional.",
      "disneyCopyAlt": "Logo Disney",
      "movieLandingPage": "Filme - Landing Page",
      "movieLandingPageDesc": "Landing page desenvolvida como projeto educacional para a EBAC, inspirada no universo de “Como Treinar o Seu Dragão”. O site apresenta informações sobre os filmes, personagens e onde assistir, com design responsivo, galeria de imagens e navegação intuitiva. O objetivo foi praticar habilidades de front-end, criar uma experiência imersiva para fãs e demonstrar domínio em HTML, CSS e JavaScript.",
      "movieLandingPageAlt": "Pôster do filme Como Treinar o Seu Dragão",
      "hemaToma": "Hema Toma",
      "hemaTomaDesc": "Site criado para um grupo de amigos apaixonados por jogos, com o objetivo de reunir informações sobre eventos, campeonatos, missões multiplayer e experiências compartilhadas. O projeto destaca a importância do trabalho em equipe, diversão e companheirismo, trazendo seções sobre jogos favoritos, propósitos do grupo e formas de contato. Desenvolvido com foco em responsividade, visual gamer e integração de conteúdos dinâmicos.",
      "hemaTomaAlt": "Controle de video game",
      "restaurant": "Restaurante",
      "restaurantDesc": "Landing page desenvolvida para um restaurante fictício, com o objetivo de apresentar o cardápio, ambiente e diferenciais do estabelecimento. O site conta com design moderno, seções para pratos, contato e localização, além de ser totalmente responsivo para diferentes dispositivos. O projeto foi criado para praticar habilidades de front-end, focando em usabilidade, visual atrativo e navegação intuitiva.",
      "restaurantAlt": "Interior de um restaurante",
      "stopwatch": "Cronômetro",
      "stopwatchDesc": "Aplicativo de cronômetro online desenvolvido para facilitar a contagem de tempo em diversas atividades. Possui interface simples, responsiva e intuitiva, permitindo iniciar, pausar e zerar o tempo facilmente. Projeto criado para praticar habilidades em React, TypeScript e CSS, com foco em usabilidade e performance.",
      "stopwatchAlt": "Cronômetro",
      "allfood": "Allfood",
      "allfoodDesc": "Plataforma de delivery e restaurantes desenvolvida para facilitar o gerenciamento de estabelecimentos e pedidos, sem a necessidade de um desenvolvedor para alimentar o site. O projeto conta com frontend em React.js, backend em Node.js/Express, banco de dados MongoDB e autenticação JWT. Interface amigável, responsiva e dinâmica, permitindo que usuários explorem pratos e restaurantes de forma prática e intuitiva.",
      "allfoodAlt": "Site de entrega de comida",
      "phoneBook": "Lista Telefônica",
      "phoneBookDesc": "Aplicação web desenvolvida para gerenciar contatos de forma simples e eficiente. Permite adicionar, editar, buscar e remover números de telefone, com interface responsiva e intuitiva. Projeto criado para praticar habilidades em AngularJS, CSS e Bootstrap, focando em usabilidade e organização de dados.",
      "phoneBookAlt": "Ilustração de uma lista telefônica",
      "randomizer": "Sorteador",
      "randomizerAlt": "Sorteador numérico",
      "spotifyClone": "Cópia Spotify",
      "spotifyCloneDesc": "Projeto de clone da interface do Spotify, desenvolvido para praticar habilidades em JavaScript, CSS e HTML. O objetivo foi recriar a experiência visual da plataforma de streaming de música, com navegação entre playlists, player customizado e layout responsivo. Ideal para demonstrar domínio em front-end e atenção aos detalhes de UI/UX.",
      "spotifyCloneAlt": "Captura de tela do aplicativo Spotify",
      "portfolioLess": "Portfólio Less",
      "portfolioLessDesc": "Portfólio moderno desenvolvido em Next.js, com foco em responsividade, alternância de tema (light/dark), animações e experiência do usuário. Inclui seções como Sobre Mim, Habilidades e Projetos, além de filtragem dinâmica por tecnologia. Utiliza Tailwind CSS, variáveis CSS e internacionalização para múltiplos idiomas. Ideal para demonstrar domínio em front-end, UX e melhores práticas de desenvolvimento.",
      "portfolioLessAlt": "Miniatura do site de portfólio",
      "newsBlog": "Blog de Notícias",
      "newsBlogAlt": "Jornal",
      "nekoShop": "Neko Shop",
      "nekoShopAlt": "Logo de gato laranja",
      "gameShop": "Game Shop",
      "gameShopAlt": "Dois controles de video game",
      "newsPortal": "Portal de Notícias",
      "newsPortalAlt": "Jornal",
      "form": "Formulário",
      "formAlt": "Prancheta",
      "photoGallery": "Galeria de Fotos",
      "photoGalleryAlt": "Câmera",
      "ebacMotors": "Ebac Motors",
      "ebacMotorsAlt": "Carro",
      "salesAd": "Anúncio de Venda",
      "salesAdAlt": "Carrinho de compras",
      "portalNewsGrid": "Portal News",
      "portalNewsGridAlt": "Jornal",
      "agenda": "Agenda",
      "agendaAlt": "Logo de telefone",
      "gradeSystem": "Sistema de Médias",
      "gradeSystemAlt": "Calculadora",
      "todoList": "Lista de Tarefas",
      "todoListAlt": "Formulário",
      "sectionAriaLabel": "Seção de projetos com fundo animado",
      "siteButton": "Site",
      "githubButton": "GitHub",
      "aura": "Aura",
      "auraAlt": "Miniatura do app Aura em Ionic",
      "auraDesc": "Aura é uma aplicação de finanças multiplataforma construída com uma stack moderna (Ionic, React, TypeScript, Vite). A sua arquitetura é componentizada e reativa, utilizando Hooks customizados para separar a lógica de negócio da UI e a Context API para a gestão de estado global. O backend é uma solução ‘serverless’ no Firebase, com um Cloud Firestore em tempo real (onSnapshot) para sincronização instantânea, Cloud Functions agendadas para automação (transações recorrentes) e regras de segurança granulares para proteger os dados. O projeto demonstra capacidades avançadas com funcionalidades como gestão de parcelamentos, partilha de finanças entre utilizadores e dashboards dinâmicos."
    },
    "navBar": {
      "home": "Início",
      "aboutMe": "Sobre",
      "skills": "Habilidades",
      "projects": "Destaques",
      "contact": "Contato"
    },
    "contact": {
      "viewResume": "Visualizar Currículo",
      "downloadResume": "Baixar Currículo"
    }
  }
}